milovanpms/tictac/firmware/drivers/bsp/epaper/stm32g4_epaper_config.h
/*****************************************************************************
* | File      	:   stm32g4_epaper_config.h
* | Author      :   Waveshare team
* | Function    :   Hardware underlying interface
* | Info        :
*                Used to shield the underlying layers of each master
*                and enhance portability
*----------------
* |	This version:   V2.0
* | Date        :   2018-10-30
* | Info        :
* 1.add:
*   UBYTE\UWORD\UDOUBLE
* 2.Change:
*   EPD_RST -> EPD_RST_PIN
*   EPD_DC -> EPD_DC_PIN
*   EPD_CS -> EPD_CS_PIN
*   EPD_BUSY -> EPD_BUSY_PIN
* 3.Remote:
*   EPD_RST_1\EPD_RST_0
*   EPD_DC_1\EPD_DC_0
*   EPD_CS_1\EPD_CS_0
*   EPD_BUSY_1\EPD_BUSY_0
* 3.add:
*   #define DEV_Digital_Write(_pin, _value) bcm2835_gpio_write(_pin, _value)
*   #define DEV_Digital_Read(_pin) bcm2835_gpio_lev(_pin)
*   #define DEV_SPI_WriteByte(__value) bcm2835_spi_transfer(__value)
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documnetation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to  whom the Software is
# furished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS OR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
# THE SOFTWARE.
#
******************************************************************************/

#ifndef _DEV_CONFIG_H_
#define _DEV_CONFIG_H_

#include "stm32g4xx_hal.h"
#include "stm32g4_gpio.h"
#include <stdint.h>
#include <stdio.h>

#define UBYTE   uint8_t
#define UWORD   uint16_t
#define UDOUBLE uint32_t

// SPI
extern SPI_HandleTypeDef hspi1;
#define EPD_SPI_HANDLE hspi1

// Définition des broches GPIO pour l'écran e-paper
#define EPD_CS_PIN      GPIO_PIN_4  // Chip Select
#define EPD_CS_GPIO     GPIOA
#define EPD_RST_PIN     GPIO_PIN_3  // Reset
#define EPD_RST_GPIO    GPIOB
#define EPD_DC_PIN      GPIO_PIN_8 // Data/Command
#define EPD_DC_GPIO     GPIOA
#define EPD_BUSY_PIN    GPIO_PIN_0  // Busy
#define EPD_BUSY_GPIO   GPIOB

void DEV_Digital_Write(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint8_t value);
uint8_t DEV_Digital_Read(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void DEV_SPI_WriteByte(uint8_t data);
void DEV_SPI_WriteByte_Init(uint8_t data);

void DEV_Delay_ms(uint32_t ms);

void DEV_Module_Init(void);
void DEV_Module_Exit(void);

#endif
